package tasks

import "fmt"

//10.	Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
//Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.
//Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

func Task10() {
	temperature := []float32{100.3, -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, 33.8, 5.9, 1}
	ref := make(map[int][]float32)
	for _, n := range temperature {
		j := n / 10
		ref[int(j)*10] = append(ref[int(j)*10], n) // обновляем в карте срез значений
	}

	fmt.Println(ref)
}
